mavishak/cnss-embedded/stm32-f103rb-cnss/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialised, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

#include "stm32f103xb.h"
// #include "cmsis_gcc.h"/*for __disable/enable_irq()*/
// #include "core_cm3.h" /*for NVIC_enableIRQ() and NVIC_SetPriority()*/
#include "event_queue.h"
#include "hc-sr501pir_sensor.h"
#include "usart.h"
#include "esp8266_Firebase.h"


#include "esp8266_WiFi.h" /*for testing usart1...*/
#include "timers.h"


int main(void)
{

	//init_sensor_with_interrupt();
	//init_sensor_led_response();
	init_usart2(); // for dbugging

	init_timer2();
	init_timer3();
	init_timer4();

	//init_usart1(); // for ESP8266
	write_usart2((uint8_t*)("\r\n_______________\r\n"));//For test

	//recordAlert();

	while(1)
	{
		delay_with_timer3(1000);
		write_usart2((uint8_t*)(":)\r\n"));

		delay_with_timer2(1000);
		write_usart2((uint8_t*)(":|\r\n"));

		delay_with_timer4(1);
		write_usart2((uint8_t*)(":/\r\n"));

		while(!timeout_with_timer2(1000));
		write_usart2((uint8_t*)(":(\r\n"));

		while(!timeout_with_timer3(1000));
		write_usart2((uint8_t*)(";)\r\n"));

		while(!timeout_with_timer4(1));
		write_usart2((uint8_t*)(":D\r\n"));

	}
}
